[{"id":0,"client":"Milliman","clientId":"milliman","year":2023,"url":"//us.milliman.com/en/products/datalytics-defense","role":"Senior UI Developer","projectName":"E-Billing and Analytics Solution","projectDescription":"E-Billing and Analytics SaaS","fragment":"#/work/milliman","skills":"TypeScript, React, C#, Node.js, Webpack, Azure, GIT, Knockout.js, HTML5, CSS3, jQuery","software":"Visual Studio, SQL Server Management Studio","longDesc":"<p>Banged out code</p>","image":{"width":"100%","height":"360","alt":"Milliman Datalytics-Defense","name":"media-milliman-test.jpg"}},{"id":1,"client":"Innovata LLC.","clientId":"innovata","year":2013,"url":"//rtw.oneworld.com/rtw/","role":"Front End Web Developer","projectName":"Flight Itinerary Scheduler","projectDescription":"SPA for airline industry","fragment":"#/work/innovata","skills":"JavaScript, Require.js, Knockout.js, HTML5, Google Maps, jQuery, oAuth","software":"Sublime Text 2, Visual Studio 2012","longDesc":"<p>Worked as front-end developer to deliver a single page javascript application to a leading global airline alliance comprised of 13 different airlines. The application functions as an itinerary planner, flight selection, and booking tool for flights that will take you around the world. It has validation rules that guide you towards picking a valid itinerary of destinations and flights.</p><p>The javascript application uses javascript, consumes json data, and communicates with several C# webservices. The javascript frameworks are knockout.js, require.js, jQueryUI, jQuery, and the Google Maps V3 API</p><p>I was responsible for integrating the Google Maps API. Developing user workflow logic. Integrating and customizing jQuery datepicker and autocomplete as defined by the business logic. Consume and bind JSON data to the UI. Form validation. Build view models.</p>","image":{"width":"100%","height":"360","alt":"oneWorld single page application","name":"slide-one-world.jpg"}},{"id":2,"client":"Pratt Plus","clientId":"prattPlus","year":2012,"url":"//www.prattplus.com","role":"Front End Web Developer","projectName":"PrattPlus ECommerce Site","projectDescription":"Custom built ECommerce platform","fragment":"#/work/prattPlus","skills":"JavaScript, PHP, C#, BASH, Prototype.js, HTML5, CSS3, jQuery, Image Optimization","software":"Sublime Text 2, Visual Studio 2010, Dragon Disk, S3CMD, Photoshop CS5","longDesc":"<p>PrattPlus is an E-Commerce platform serving a multi-national recycling, and corrugate manufacturer. The site was started in 2011, and aimed to increase revenue and accessibility of their existing product line, in addition to housing 40,000 additional office products for sale online. <a href=\"http://www.prattplus.com\" target=\"_blank\">www.prattplus.com</a>.</p><p>The site was built in C#, SQL, and leverages AWS, and Prototype.js. I came on board as a front end web developer to skin the site, build HTML templates, work with creative, and build javaScript functionality.</p><p>Within a small development team, I have worn many hats. I have coded in C#, PHP, BASH scripts, and have written webservices from time to time.</p><p>My more exciting endeavor was working with backbone.js to deliver a prototype of a Single Page Application, and the process of converting the website to a responsive layout for an enhanced user experience on tablet and mobile.</p>","image":{"width":"100%","height":"360","alt":"Pratt Plus ECommerce Site","name":"slide-prattPlus.jpg"}},{"id":3,"client":"Pratt Industries Inc.","clientId":"prattIndustries","year":2012,"role":"Front End Web Developer","projectName":"Pratt Industries Corporate Site","projectDescription":"Corporate Sites built on WordPress","url":"http://www.prattindustries.com/","fragment":"#/work/prattIndustries","skills":"JavaScript, PHP, BASH, Backbone.js, HTML5, CSS3, jQuery, Image Optimization","software":"Sublime Text 2, WordPress, Dragon Disk, Photoshop CS5, Visual Studio 2010","longDesc":"<p>Pratt Industries is a leading multi-national recycling and paper product manufacturing company.<!-- 5th largest converter of recycled to box in the US, 5 billion $ company --> They provide corrugate products to some big names in the retail industry including: Home Depot and Walmart. <a href=\"http://www.prattindustries.com\" target=\"_blank\">Pratt Industries</a></p><p>I was contracted by Pratt Industries to build a network of corporate sites for each company articleision using the WordPress Multisite platform. I hand coded a full featured site that contains custom javaScript slideshows, accordions, AJAX contact forms, form error handling, JSON webservices, and MailChimp API integration leveraging jQuery and PHP.</p><p>A highlight of the project included building an automated process to synchronize the code base between two servers using Amazon S3, Linux Bash scripting, and S3CMD.</p>","image":{"width":"100%","height":"360","alt":"Pratt Industries Corporate Site","name":"slide-pratt-corporate.jpg"}},{"id":4,"client":"WebMd","clientId":"webMd","year":2011,"role":"Front End Web Developer","url":"http://fit.webmd.com/jr/recharge/default.htm","projectName":"Sanford Health, Fit Initiative","projectDescription":"Custom website built for Sanford Medical","fragment":"#/work/webMd","skills":"HTML5, CSS3, jQuery, Subversion, Photoshop, Image Optimization","software":"Sublime Text 2, Photoshop CS5, Documentum, Charles web proxy","longDesc":"<p><strong>WebMD</strong>, the leading source for trustworthy health and medical news information contracted me as a front end web developer to join a team of programmers to build a brand new web product geared to teach kids about the benefits of healthy living. This website has been named the &quot;FIT Initiative&quot; and is divided into three sub-categories based on age: Teens, Kids, and Juniors. The project had a budget of 850K+ and was staffed with 15 developers, not to mention designers, content writers, and marketing specialists. Each site contains different types of dynamically driven interactive content: Flash games, slideshows, video players, downloadable .pdf activities, and articles.</p><p>I built the &quot;juniors&quot; site: <a href=\"http://fit.webmd.com/jr/\" target=\"_blank\">fit.webmd.com</a>. My core functions were to hand code the XHTML5 and CSS3 slice the Photoshop files, and work with the javaScript lead to wire the DOM to the scripts.</p><p>One of my challenges on the project was integrating my markup and CSS into WebMD's legacy content management and templating system. The process required careful management of the CSS cascade around WebMD's existing CSS rules, and some interesting positioning when your module did not get priority placement within the markup.</p><p>The website had a dedicated design team and delivered more than 50 .psd files for the juniors site: of which, I sliced, made sprites, and optimized all images. I skinned and modified the javaScript of WebMD's legacy flash video player, and audio slideshow to integrate with the design.</p>","image":{"width":"100%","height":"360","alt":"Sanford Health, Fit Initiative","name":"slide-webmd.jpg"}},{"id":6,"client":"AboveMedia","clientId":"aboveMedia","year":2010,"url":"http://www.hiregenics.com","role":"Front End Web Developer","projectName":"Rocket Comm Corporate Site","projectDescription":"Coporate website built on Joomla!","fragment":"#/work/aboveMedia","skills":"HTML5, CSS3, jQuery, joomla!, UI Design, Phototoshop","software":"Coda, Photoshop CS3","longDesc":"<p>I was contracted by AboveMedia to assist the interactive team in the design and build of the re-designed Rocket Comm website. Rocket Comm is an established, Workforce management company with offices located throughout the US, and specializes in payrolling, IC classification, and VMS services.</p>","image":{"width":"100%","height":"360","alt":"Rocket Comm Corporate Site","name":"slide-rocketComm.jpg"}},{"id":5,"client":"Holder Properties","clientId":"holderProperties","year":2010,"role":"Front End Web Developer","url":"http://clients.jcs-productions.com/holderProperties/","projectName":"Condominium Rentals","projectDescription":"Condo rental website built on WordPress","fragment":"#/work/holderProperties","skills":"HTML5, CSS3, jQuery, Wordpress, PHP, Google Maps API, UI Design, Phototoshop","software":"Sublime Text 2, Photoshop CS5","longDesc":"<p>Holder Properties contracted me to build a website that showcased their vacation condo in St. Simons Island, GA. My strategy was to build a unique experience that allowed the user fast access to the necessary information required to sell and book the condo.</p><p>The site was built on the Wordpress platform. I designed, and hand coded the site, and all UI features myself. I built a &quot;plugin like&quot; javaScript Slider, custom AJAX contact forms, and error handling. I had the most fun working with the Google Maps API, to deliver driving time, mileage, and route information to and from the condo within a custom skin, <a href=\"http://clients.jcs-productions.com/holderProperties/contact-us/#findUs\" target=\"_blank\">see it here.</a></p>","image":{"width":"100%","height":"360","alt":"Condominium Rentals","name":"media_holderProperties.jpg"}}]